{
  "format": "layers-model",
  "generatedBy": "keras v3.12.0",
  "convertedBy": "convert_keras_to_tfjs.py",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "input_layer",
            "batchInputShape": [
              null,
              512
            ]
          }
        },
        {
          "class_name": "Embedding",
          "config": {
            "name": "embedding",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "className": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registeredName": null
            },
            "inputDim": 88,
            "outputDim": 64,
            "embeddingsInitializer": {
              "module": "keras.initializers",
              "className": "RandomUniform",
              "config": {
                "seed": null,
                "minval": -0.05,
                "maxval": 0.05
              },
              "registeredName": null
            },
            "embeddingsRegularizer": null,
            "activityRegularizer": null,
            "embeddingsConstraint": null,
            "maskZero": false
          }
        },
        {
          "class_name": "Conv1D",
          "config": {
            "name": "conv1d",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "className": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registeredName": null
            },
            "filters": 128,
            "kernelSize": [
              5
            ],
            "strides": [
              1
            ],
            "padding": "same",
            "dataFormat": "channels_last",
            "dilationRate": [
              1
            ],
            "groups": 1,
            "activation": "relu",
            "useBias": true,
            "kernelInitializer": {
              "module": "keras.initializers",
              "className": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registeredName": null
            },
            "biasInitializer": {
              "module": "keras.initializers",
              "className": "Zeros",
              "config": {},
              "registeredName": null
            },
            "kernelRegularizer": null,
            "biasRegularizer": null,
            "activityRegularizer": null,
            "kernelConstraint": null,
            "biasConstraint": null
          }
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "className": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registeredName": null
            },
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "betaInitializer": {
              "module": "keras.initializers",
              "className": "Zeros",
              "config": {},
              "registeredName": null
            },
            "gammaInitializer": {
              "module": "keras.initializers",
              "className": "Ones",
              "config": {},
              "registeredName": null
            },
            "movingMeanInitializer": {
              "module": "keras.initializers",
              "className": "Zeros",
              "config": {},
              "registeredName": null
            },
            "movingVarianceInitializer": {
              "module": "keras.initializers",
              "className": "Ones",
              "config": {},
              "registeredName": null
            },
            "betaRegularizer": null,
            "gammaRegularizer": null,
            "betaConstraint": null,
            "gammaConstraint": null,
            "synchronized": false
          }
        },
        {
          "class_name": "MaxPooling1D",
          "config": {
            "name": "max_pooling1d",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "className": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registeredName": null
            },
            "poolSize": [
              2
            ],
            "padding": "valid",
            "strides": [
              2
            ],
            "dataFormat": "channels_last"
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "className": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registeredName": null
            },
            "rate": 0.3,
            "seed": null,
            "noiseShape": null
          }
        },
        {
          "class_name": "Conv1D",
          "config": {
            "name": "conv1d_1",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "className": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registeredName": null
            },
            "filters": 256,
            "kernelSize": [
              5
            ],
            "strides": [
              1
            ],
            "padding": "same",
            "dataFormat": "channels_last",
            "dilationRate": [
              1
            ],
            "groups": 1,
            "activation": "relu",
            "useBias": true,
            "kernelInitializer": {
              "module": "keras.initializers",
              "className": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registeredName": null
            },
            "biasInitializer": {
              "module": "keras.initializers",
              "className": "Zeros",
              "config": {},
              "registeredName": null
            },
            "kernelRegularizer": null,
            "biasRegularizer": null,
            "activityRegularizer": null,
            "kernelConstraint": null,
            "biasConstraint": null
          }
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization_1",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "className": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registeredName": null
            },
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "betaInitializer": {
              "module": "keras.initializers",
              "className": "Zeros",
              "config": {},
              "registeredName": null
            },
            "gammaInitializer": {
              "module": "keras.initializers",
              "className": "Ones",
              "config": {},
              "registeredName": null
            },
            "movingMeanInitializer": {
              "module": "keras.initializers",
              "className": "Zeros",
              "config": {},
              "registeredName": null
            },
            "movingVarianceInitializer": {
              "module": "keras.initializers",
              "className": "Ones",
              "config": {},
              "registeredName": null
            },
            "betaRegularizer": null,
            "gammaRegularizer": null,
            "betaConstraint": null,
            "gammaConstraint": null,
            "synchronized": false
          }
        },
        {
          "class_name": "MaxPooling1D",
          "config": {
            "name": "max_pooling1d_1",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "className": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registeredName": null
            },
            "poolSize": [
              2
            ],
            "padding": "valid",
            "strides": [
              2
            ],
            "dataFormat": "channels_last"
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_1",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "className": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registeredName": null
            },
            "rate": 0.3,
            "seed": null,
            "noiseShape": null
          }
        },
        {
          "class_name": "Conv1D",
          "config": {
            "name": "conv1d_2",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "className": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registeredName": null
            },
            "filters": 128,
            "kernelSize": [
              3
            ],
            "strides": [
              1
            ],
            "padding": "same",
            "dataFormat": "channels_last",
            "dilationRate": [
              1
            ],
            "groups": 1,
            "activation": "relu",
            "useBias": true,
            "kernelInitializer": {
              "module": "keras.initializers",
              "className": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registeredName": null
            },
            "biasInitializer": {
              "module": "keras.initializers",
              "className": "Zeros",
              "config": {},
              "registeredName": null
            },
            "kernelRegularizer": null,
            "biasRegularizer": null,
            "activityRegularizer": null,
            "kernelConstraint": null,
            "biasConstraint": null
          }
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "name": "batch_normalization_2",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "className": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registeredName": null
            },
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "betaInitializer": {
              "module": "keras.initializers",
              "className": "Zeros",
              "config": {},
              "registeredName": null
            },
            "gammaInitializer": {
              "module": "keras.initializers",
              "className": "Ones",
              "config": {},
              "registeredName": null
            },
            "movingMeanInitializer": {
              "module": "keras.initializers",
              "className": "Zeros",
              "config": {},
              "registeredName": null
            },
            "movingVarianceInitializer": {
              "module": "keras.initializers",
              "className": "Ones",
              "config": {},
              "registeredName": null
            },
            "betaRegularizer": null,
            "gammaRegularizer": null,
            "betaConstraint": null,
            "gammaConstraint": null,
            "synchronized": false
          }
        },
        {
          "class_name": "MaxPooling1D",
          "config": {
            "name": "max_pooling1d_2",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "className": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registeredName": null
            },
            "poolSize": [
              2
            ],
            "padding": "valid",
            "strides": [
              2
            ],
            "dataFormat": "channels_last"
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_2",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "className": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registeredName": null
            },
            "rate": 0.3,
            "seed": null,
            "noiseShape": null
          }
        },
        {
          "class_name": "GlobalAveragePooling1D",
          "config": {
            "name": "global_average_pooling1d",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "className": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registeredName": null
            },
            "dataFormat": "channels_last",
            "keepdims": false
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "className": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registeredName": null
            },
            "units": 256,
            "activation": "relu",
            "useBias": true,
            "kernelInitializer": {
              "module": "keras.initializers",
              "className": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registeredName": null
            },
            "biasInitializer": {
              "module": "keras.initializers",
              "className": "Zeros",
              "config": {},
              "registeredName": null
            },
            "kernelRegularizer": null,
            "biasRegularizer": null,
            "kernelConstraint": null,
            "biasConstraint": null
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_3",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "className": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registeredName": null
            },
            "rate": 0.5,
            "seed": null,
            "noiseShape": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "className": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registeredName": null
            },
            "units": 128,
            "activation": "relu",
            "useBias": true,
            "kernelInitializer": {
              "module": "keras.initializers",
              "className": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registeredName": null
            },
            "biasInitializer": {
              "module": "keras.initializers",
              "className": "Zeros",
              "config": {},
              "registeredName": null
            },
            "kernelRegularizer": null,
            "biasRegularizer": null,
            "kernelConstraint": null,
            "biasConstraint": null
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_4",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "className": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registeredName": null
            },
            "rate": 0.5,
            "seed": null,
            "noiseShape": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "className": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registeredName": null
            },
            "units": 64,
            "activation": "relu",
            "useBias": true,
            "kernelInitializer": {
              "module": "keras.initializers",
              "className": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registeredName": null
            },
            "biasInitializer": {
              "module": "keras.initializers",
              "className": "Zeros",
              "config": {},
              "registeredName": null
            },
            "kernelRegularizer": null,
            "biasRegularizer": null,
            "kernelConstraint": null,
            "biasConstraint": null
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_5",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "className": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registeredName": null
            },
            "rate": 0.3,
            "seed": null,
            "noiseShape": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_3",
            "trainable": true,
            "dtype": {
              "module": "keras",
              "className": "DTypePolicy",
              "config": {
                "name": "float32"
              },
              "registeredName": null
            },
            "units": 1,
            "activation": "sigmoid",
            "useBias": true,
            "kernelInitializer": {
              "module": "keras.initializers",
              "className": "GlorotUniform",
              "config": {
                "seed": null
              },
              "registeredName": null
            },
            "biasInitializer": {
              "module": "keras.initializers",
              "className": "Zeros",
              "config": {},
              "registeredName": null
            },
            "kernelRegularizer": null,
            "biasRegularizer": null,
            "kernelConstraint": null,
            "biasConstraint": null
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "embedding/embeddings",
          "shape": [
            88,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d/kernel",
          "shape": [
            5,
            64,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/gamma",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/beta",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/moving_mean",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/moving_variance",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d_1/kernel",
          "shape": [
            5,
            128,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d_1/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/gamma",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/beta",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_mean",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_variance",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d_2/kernel",
          "shape": [
            3,
            256,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d_2/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/gamma",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/beta",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_mean",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_variance",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/kernel",
          "shape": [
            128,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            256,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            128,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/kernel",
          "shape": [
            64,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_3/bias",
          "shape": [
            1
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}