{
  "char_to_idx": {
    "\n": 1,
    " ": 2,
    "!": 3,
    "\"": 4,
    "#": 5,
    "$": 6,
    "%": 7,
    "&": 8,
    "'": 9,
    "(": 10,
    ")": 11,
    "*": 12,
    "+": 13,
    ",": 14,
    "-": 15,
    ".": 16,
    "/": 17,
    "0": 18,
    "1": 19,
    "2": 20,
    "3": 21,
    "4": 22,
    "5": 23,
    "6": 24,
    "7": 25,
    "8": 26,
    "9": 27,
    ":": 28,
    ";": 29,
    "<": 30,
    "=": 31,
    ">": 32,
    "@": 33,
    "[": 34,
    "\\": 35,
    "]": 36,
    "^": 37,
    "_": 38,
    "a": 39,
    "b": 40,
    "c": 41,
    "d": 42,
    "e": 43,
    "f": 44,
    "g": 45,
    "h": 46,
    "i": 47,
    "j": 48,
    "k": 49,
    "l": 50,
    "m": 51,
    "n": 52,
    "o": 53,
    "p": 54,
    "q": 55,
    "r": 56,
    "s": 57,
    "t": 58,
    "u": 59,
    "v": 60,
    "w": 61,
    "x": 62,
    "y": 63,
    "z": 64,
    "{": 65,
    "|": 66,
    "}": 67,
    "~": 68,
    "\u0082": 69,
    "\u0083": 70,
    "\u008b": 71,
    "\u0095": 72,
    "\u009c": 73,
    "\u00a0": 74,
    "\u00af": 75,
    "\u00b1": 76,
    "\u00b3": 77,
    "\u00b4": 78,
    "\u00b5": 79,
    "\u00bd": 80,
    "\u00bf": 81,
    "\u00e2": 82,
    "\u00e3": 83,
    "\u00eb": 84,
    "\u00ec": 85,
    "\u00ee": 86,
    "\u00ef": 87
  },
  "idx_to_char": {
    "1": "\n",
    "2": " ",
    "3": "!",
    "4": "\"",
    "5": "#",
    "6": "$",
    "7": "%",
    "8": "&",
    "9": "'",
    "10": "(",
    "11": ")",
    "12": "*",
    "13": "+",
    "14": ",",
    "15": "-",
    "16": ".",
    "17": "/",
    "18": "0",
    "19": "1",
    "20": "2",
    "21": "3",
    "22": "4",
    "23": "5",
    "24": "6",
    "25": "7",
    "26": "8",
    "27": "9",
    "28": ":",
    "29": ";",
    "30": "<",
    "31": "=",
    "32": ">",
    "33": "@",
    "34": "[",
    "35": "\\",
    "36": "]",
    "37": "^",
    "38": "_",
    "39": "a",
    "40": "b",
    "41": "c",
    "42": "d",
    "43": "e",
    "44": "f",
    "45": "g",
    "46": "h",
    "47": "i",
    "48": "j",
    "49": "k",
    "50": "l",
    "51": "m",
    "52": "n",
    "53": "o",
    "54": "p",
    "55": "q",
    "56": "r",
    "57": "s",
    "58": "t",
    "59": "u",
    "60": "v",
    "61": "w",
    "62": "x",
    "63": "y",
    "64": "z",
    "65": "{",
    "66": "|",
    "67": "}",
    "68": "~",
    "69": "\u0082",
    "70": "\u0083",
    "71": "\u008b",
    "72": "\u0095",
    "73": "\u009c",
    "74": "\u00a0",
    "75": "\u00af",
    "76": "\u00b1",
    "77": "\u00b3",
    "78": "\u00b4",
    "79": "\u00b5",
    "80": "\u00bd",
    "81": "\u00bf",
    "82": "\u00e2",
    "83": "\u00e3",
    "84": "\u00eb",
    "85": "\u00ec",
    "86": "\u00ee",
    "87": "\u00ef"
  },
  "vocab_size": 87,
  "max_url_length": 512
}